/**
* @file		IStringConvertible.inl
* @brief	型をstringにするインターフェース実装
* @author	S.OIKAWA
* @date		2016.09.19
*/

#pragma region include
//-----------------------------------------------------------
// include
//-----------------------------------------------------------
#include"IStringConvertible.h"
#pragma endregion

//-----------------------------------------------------------
// define
//-----------------------------------------------------------

//-----------------------------------------------------------
// IStringConvertible
//-----------------------------------------------------------
template<class Type>
inline std::string IStringConvertible<Type>::ToString()
{
	return std::string(typeid(Type).name());
}

//-----------------------------------------------------------
// EOF
//-----------------------------------------------------------