/**
* @file		IThreadJob.h
* @brief	スレッドで実行するジョブインターフェース
* @author	S.OIKAWA
* @date		2016.4.29
*/
#pragma once
//-----------------------------------------------------------
// define
//-----------------------------------------------------------

namespace Pyramid
{
	namespace MT
	{
		namespace Jobs
		{
			/// <summary>
			/// スレッド処理するジョブ
			/// これ以外にpJobsのプロパティを用意する必要がある
			/// </summary>
			__interface IThreadJob
			{
				void Job();
			};
			
		}
	}
}
//-----------------------------------------------------------
// EOF
//-----------------------------------------------------------

