/**
	  * @file		ColorChannel.h
	  * @brief		カラーチャンネルDao提供
	  * @author		S.OIKAWA
	  * @date		2016.10.15
	  */

#pragma once
	  //-----------------------------------------------------------
	  // defnie 
	  //-----------------------------------------------------------

namespace DataObject
{
	namespace DAO
	{
		/// <summary>
		/// 今は実装しない
		/// </summary>
		class ColorChannel
		{
		};
	}
}
//-----------------------------------------------------------
// EOF 
//-----------------------------------------------------------