/**
* @file		PlayerModule.cpp
* @brief	プレイヤーに追加されるコンポーネント
* @author	S.OIKAWA
* @date		2017.02.15
*/

#pragma region include
//-----------------------------------------------------------
// include
//-----------------------------------------------------------
#include"PlayerModule.h"
#pragma endregion

//-----------------------------------------------------------
// define
//-----------------------------------------------------------
namespace Pyramid
{
	namespace App
	{
		namespace Extension
		{
			namespace Component
			{
				//-----------------------------------------------------------
				// ctor
				//-----------------------------------------------------------
				PlayerModule::PlayerModule(Object::Actor * _pPlayer):
					m_pPlayer(_pPlayer)
				{
				}

				//-----------------------------------------------------------
				// Init
				//-----------------------------------------------------------
				void PlayerModule::Init()
				{
					if (!m_pPlayer)
					{
						m_pPlayer = m_pOwner->CastTo<Object::Actor *>();
					}
				}
			}
		}
	}
}

//-----------------------------------------------------------
// EOF
//-----------------------------------------------------------