/**
* @file		Service.h
* @brief	Entityを取得するインターフェースを提供
* @author	S.OIKAWA
* @date		2016.10.23
*/

#pragma once
//-----------------------------------------------------------
// include 
//-----------------------------------------------------------
#include"Service.h"

//-----------------------------------------------------------
// DaoからEntityを生成する
//-----------------------------------------------------------
template<class Entity, class Dao>
inline Entity Service<Entity, Dao>::
Create(typename Dao::ParamType param)
{
	return m_Dao.From(param);
}

//-----------------------------------------------------------
// EOF 
//-----------------------------------------------------------
