/**
* @file		Sphere.cpp
* @brief	è’ìÀîªíËãÖ
* @author	S.OIKAWA
* @date		2017.03.04
*/

#pragma region include
//-----------------------------------------------------------
// include
//-----------------------------------------------------------
#include"Sphere.h"
#include"../Components/Transform.h"

#pragma endregion

//-----------------------------------------------------------
// define
//-----------------------------------------------------------
namespace Pyramid
{
	namespace Common
	{
		namespace Diagram
		{

			//-----------------------------------------------------------
			// ctor
			//-----------------------------------------------------------
			Sphere::Sphere() : 
				m_R(0.0f)
			{
			}

			//-----------------------------------------------------------
			// ReflectionOfTransfrom
			//-----------------------------------------------------------
			void Sphere::ReflectionOfTransfrom(Common::Sp<Components::Transform>& _spTrans)
			{
				m_Center = _spTrans->Position;
			}

			//-----------------------------------------------------------
			// ScaleTo 
			//-----------------------------------------------------------
			void Sphere::ScaleTo(const Utility::Vector3 & _scale)
			{
				m_R *= max(_scale.X,max(_scale.Y, _scale.Z));
			}
			
			//-----------------------------------------------------------
			// MoveTo 
			//-----------------------------------------------------------
			void Sphere::MoveTo(const Utility::Vector3 & _moved)
			{
				m_Center = _moved;
			}

			//-----------------------------------------------------------
			// Initialize
			//-----------------------------------------------------------
			void Sphere::Initialize()
			{
				m_R = 0.0f;
				m_Center = ::Utility::Vector3::zero;
			}
		}
	}
}

//-----------------------------------------------------------
// EOF
//-----------------------------------------------------------